{
  "backend/main.mo": "Main Motoko actor defining the gym portal backend with types for users, workout plans, diet plans, exercises, and scheduled sessions; includes authorization, blob storage mixins, and HTTP outcall functionality for AI integration.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features: replacing gym buddy locator with zip code search, removing unnecessary form fields, and fixing VortexMessage component to properly display AI responses.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend React components, pages, and hooks including dashboard layouts, workout/diet plan forms, authentication, branding controls, and the Vortex AI chat interface.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for backgrounds, borders, charts, and sidebar components using oklch color space.",
  "frontend/index.html": "HTML entry point for the Gym Member Portal application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with routes for landing, dashboards (trainer/client/admin), profile setup, exercise library, flex wall, analytics, supplements, workout logs, and Vortex AI pages, wrapped in theme and branding providers.",
  "frontend/src/components/admin/BrandingControls.tsx": "Admin form component for updating gym portal branding settings including logo URL and three color pickers (primary, secondary, accent) with live preview and default fallback values.",
  "frontend/src/components/admin/ClientAssignment.tsx": "Admin component for assigning clients to trainers using dropdowns to select from filtered user lists and calling the assignClientToTrainer mutation.",
  "frontend/src/components/admin/ExerciseFormModal.tsx": "Modal dialog form for adding or editing exercises with fields for name, muscle groups, difficulty, equipment, video URL, description, and rep/set ranges.",
  "frontend/src/components/admin/ExerciseLibraryManagement.tsx": "Admin component displaying a searchable list of exercises with add, edit, and delete actions, using ExerciseFormModal for create/update operations.",
  "frontend/src/components/admin/UserFormModal.tsx": "Form component for adding or editing users with fields for Principal ID (add only), name, email, and role selection.",
  "frontend/src/components/admin/UserManagement.tsx": "Admin component displaying a table of all users with add, edit, and delete actions, using UserFormModal in a dialog for user management.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Error screen component displayed when a user lacks the required role to access a page, with a button to return home.",
  "frontend/src/components/auth/RoleGuard.tsx": "Authorization wrapper component that checks if the current user has the required role and shows AccessDeniedScreen if not.",
  "frontend/src/components/client/AutoRestTimer.tsx": "A countdown timer component for tracking rest periods between workout sets, featuring play/pause/reset controls, progress bar, and visual alerts when time is running low or complete.",
  "frontend/src/components/client/CaffeinePeakTracker.tsx": "Tracks caffeine intake and calculates optimal workout timing windows based on caffeine peak effects, allowing users to log caffeine amounts and clear intake history.",
  "frontend/src/components/client/ConnectionRequestManager.tsx": "Manages training partner connections with tabs for incoming/outgoing requests and active connections, allowing users to accept or reject connection requests.",
  "frontend/src/components/client/DietPlanView.tsx": "Displays personalized diet plans or template diet options for clients, showing meals with food items, portions, calories, and macronutrient breakdowns.",
  "frontend/src/components/client/ExerciseScheduleSection.tsx": "Static display of seven essential exercises with their target muscle groups, recommended sets/reps, and descriptions in a grid card layout.",
  "frontend/src/components/client/ExerciseVideoLibrary.tsx": "Searchable and filterable library of exercise videos with YouTube embed support, filtering by muscle group and difficulty level, and modal detail view for selected exercises.",
  "frontend/src/components/client/GeneralDietPlanSection.tsx": "Displays a static general diet plan with six meal periods (breakfast through dinner), each offering two meal options in a card-based layout with badges and icons.",
  "frontend/src/components/client/GymBuddyLocator.tsx": "Provides gym buddy finder functionality with zip code/city search, displays nearby users, and allows sending connection requests with integrated location and training partner preference forms.",
  "frontend/src/components/client/HIITClockTimer.tsx": "Implements a configurable HIIT interval timer with work/rest phases, multiple rounds, play/pause/reset controls, and visual progress tracking.",
  "frontend/src/components/client/LocationPreferenceForm.tsx": "Form component for users to set their gym location preferences including gym name and search radius, with save functionality using custom hooks.",
  "frontend/src/components/client/MusicPlaylistWidget.tsx": "Displays a workout music playlist with 10 hardcoded songs, featuring play/pause controls and audio playback using HTML5 Audio API.",
  "frontend/src/components/client/PersonalizedTracker.tsx": "A React component that calculates personalized macros (calories, protein, carbs, fats) and training splits based on user's weight, height, age, and fitness goal (bulking, cutting, maintenance, endurance) using the Mifflin-St Jeor BMR equation.",
  "frontend/src/components/client/PRLeaderboard.tsx": "Shows a leaderboard for personal records across different exercises (squat, bench press, etc.) with exercise selection, ranked display with trophy icons, and dialog form to submit new PRs.",
  "frontend/src/components/client/ProgressCharts.tsx": "Displays workout progress using a line chart showing completed sets over time and a list of recent workouts with dates and personal notes.",
  "frontend/src/components/client/SpotterAIInterface.tsx": "An AI-powered form analysis interface that displays exercise-specific tips including video demonstrations, common mistakes, and form cues fetched from backend queries.",
  "frontend/src/components/client/TDEECalculator.tsx": "Calculates Total Daily Energy Expenditure (TDEE) and macro targets based on user metrics (weight, height, age, gender), activity level, and fitness goal (weight loss, maintenance, muscle gain) with collapsible explanations.",
  "frontend/src/components/client/TimetableView.tsx": "Displays a weekly workout schedule template showing muscle groups per day, along with upcoming and past scheduled training sessions fetched from backend queries.",
  "frontend/src/components/client/TrainingPartnerPreferenceForm.tsx": "A form for users to set and save their training partner preferences including fitness goals, experience level, preferred workout times, and bio using backend mutations and queries.",
  "frontend/src/components/client/WeightProgressionDisplay.tsx": "React component for tracking weight progression on exercises, allowing users to select an exercise, log weight and reps, and view progression stats and historical entries.",
  "frontend/src/components/client/WorkoutLogForm.tsx": "Form component for logging workout completion with completed sets count and optional personal notes, submitting data via mutation hook.",
  "frontend/src/components/client/WorkoutPlanView.tsx": "Displays a workout plan card with sets, reps, weights, rest time, and trainer notes, with a button to open a dialog for logging workout completion.",
  "frontend/src/components/client/WorkoutReferenceSection.tsx": "Displays visual reference guides for workout exercises organized by muscle group (back, biceps, core) with images and descriptions.",
  "frontend/src/components/client/WorkoutSessionPanel.tsx": "Interactive workout session tracker with real-time set/rep counting, progress visualization, increment/decrement controls, and integration with rest and HIIT timers.",
  "frontend/src/components/exercise/ExerciseDetailModal.tsx": "Modal dialog displaying detailed exercise information including embedded YouTube video, difficulty level, target muscle groups, description, and form instructions.",
  "frontend/src/components/exercise/ExerciseLibraryBrowser.tsx": "A filterable exercise library browser component with search, muscle group, and difficulty filters that displays exercises in a grid and opens a detail modal when clicked.",
  "frontend/src/components/exercise/QRExerciseScanner.tsx": "QR code scanner component that uses device camera to scan exercise QR codes, parses exercise IDs from various formats, and displays exercise details with video tutorials and workout history.",
  "frontend/src/components/exercise/WorkoutTechniqueGallery.tsx": "Static gallery component displaying four workout technique reference images with titles and descriptions in a responsive grid layout.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper component that renders Header, main content area, and Footer in a flex column structure.",
  "frontend/src/components/layout/Footer.tsx": "Footer component displaying copyright information and a caffeine.ai attribution link with UTM tracking parameters.",
  "frontend/src/components/layout/Header.tsx": "Main navigation header with logo, role-based navigation menu (client/trainer/admin), authentication controls, and mobile responsive sheet menu.",
  "frontend/src/components/supplement/SupplementStackOptimizer.tsx": "Supplement recommendation component that displays curated supplement stacks based on selected fitness goals (Muscle Gain, Fat Loss, Strength, Endurance) with tabbed views for products, dosage, timing, and benefits.",
  "frontend/src/components/trainer/ClientList.tsx": "Displays a list of trainer's clients as cards with user info and a 'Create Plan' button for each client.",
  "frontend/src/components/trainer/DietPlanForm.tsx": "React form component for trainers to create diet plans with multiple meals and food items, including nutritional tracking (calories, protein, carbs, fats) and submission via useCreateDietPlan hook.",
  "frontend/src/components/trainer/TimetableScheduler.tsx": "React component for trainers to schedule workout sessions with clients by selecting a client, workout plan, date/time, and adding trainer notes, then creating a scheduled session via useCreateScheduledSession hook.",
  "frontend/src/components/trainer/WorkoutPlanForm.tsx": "React form component for trainers to create workout plans with exercise sets (reps, weight), rest time, and notes, submitting via useCreateWorkoutPlan hook.",
  "frontend/src/components/vortex/VortexChat.tsx": "Chat interface component for interacting with Vortex AI assistant, managing message history and preprocessing AI responses to remove code artifacts and formatting issues.",
  "frontend/src/components/vortex/VortexMessage.tsx": "Message display component that cleans and formats Vortex AI responses by removing code blocks, HTML, and technical metadata, then rendering content with proper list and paragraph formatting.",
  "frontend/src/contexts/BrandingContext.tsx": "React context provider that fetches branding settings and applies custom colors (primary, secondary, accent) as CSS variables to the document root for dynamic theming.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend API calls including user profiles, workout plans, diet plans, exercises, leaderboards, and Vortex AI chat, with TypeScript types for frontend data models.",
  "frontend/src/hooks/useWorkoutSession.ts": "Custom hook managing workout session state including set progress tracking, rep counting, set completion, rest timer activation, and navigation between sets.",
  "frontend/src/index.css": "Tailwind CSS configuration with dark-mode gym theme using volt green and electric blue colors, neon glow effects, and custom utility classes for borders and shadows.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin control panel page with tabbed interface for managing branding settings, users, client-trainer assignments, and exercise library.",
  "frontend/src/pages/AnalyticsDashboardPage.tsx": "Placeholder analytics dashboard page displaying upcoming features for body weight tracking, strength progression charts, volume tracking, and PR history visualization.",
  "frontend/src/pages/ClientDashboard.tsx": "Main client dashboard with tabbed interface for workout plans, progress tracking, timetable, diet plans, TDEE calculator, AI spotter, gym buddy locator, exercise library, PR leaderboard, workout references, Vortex chat, and QR exercise scanner. Displays personalized welcome message and provides access to workout session panel.",
  "frontend/src/pages/ExerciseLibraryPage.tsx": "Exercise library page displaying a comprehensive browser of exercises with video demonstrations and proper form guidance. Includes workout technique gallery and QR code scanner for quick exercise lookup.",
  "frontend/src/pages/FlexWallPage.tsx": "Placeholder page for upcoming social feed feature where users can share progress photos, PRs, and engage with the fitness community. Currently displays a 'Coming Soon' message.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, feature cards highlighting personalized tracking, community features, and AI coaching, plus a call-to-action button to navigate to the client dashboard.",
  "frontend/src/pages/ProfileSetup.tsx": "Initial profile setup form for new users to enter their name and select role (client, trainer, or admin), then navigates to the appropriate dashboard after profile creation.",
  "frontend/src/pages/SupplementStackPage.tsx": "Page featuring the supplement stack optimizer component that provides curated supplement bundle recommendations based on user fitness goals.",
  "frontend/src/pages/TrainerDashboard.tsx": "Trainer dashboard with tabs for managing clients, creating workout and diet plans, and scheduling timetables. Displays overview cards for total clients, active plans, and diet plans.",
  "frontend/src/pages/VortexAIPage.tsx": "Full-page dedicated interface for Vortex AI chat assistant with header navigation back to dashboard and full-screen chat component for AI fitness coaching.",
  "frontend/src/pages/WorkoutLogsPage.tsx": "React page component that displays workout history with statistics cards (total, weekly, monthly counts) and a chronological list of logged workouts. Currently uses placeholder data as backend workout records are not yet implemented.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support. Includes functions to get, store, clear, and persist parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, neon shadow effects, custom fonts (Inter, Poppins), and animation keyframes for accordion and pulse effects.",
  "project_state.json": "Project metadata tracking the Iron Temple fitness app state, including architectural notes about Vortex AI response parsing, gym locator zip code system, and pending feature request to fix AI chat display formatting."
}