{
  "backend/main.mo": "Main actor defining all data types (User, WorkoutPlan, Exercise, DietPlan, etc.), stores (userStore, workoutPlanStore, exerciseLibraryStore), and public API methods for managing users, workout plans, diet plans, scheduled sessions, and exercise library with authorization and blob storage mixins.",
  "backend/migration.mo": "Migration module that initializes the exercise library with seven default exercises (Squats, Push-ups, Bench Press, Deadlift, Pull-ups/Lat Pulldown, Overhead Press, Plank) including their target muscle groups, difficulty levels, equipment needs, and recommended sets/reps.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: displaying seven exercises in the exercise library browser organized by muscle groups, and displaying comprehensive diet plans with six meal times and two options per meal in the client dashboard.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including App.tsx with routing, query hooks for backend integration, branding context, layout components, dashboard pages for trainer/client/admin roles, and various UI components for workout plans, diet plans, and exercise library.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, accent, destructive, borders, and sidebar components using OKLCH color space.",
  "frontend/index.html": "HTML entry point for the Gym Member Portal application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for landing, profile setup, trainer/client/admin dashboards, and exercise library page, wrapped in ThemeProvider and BrandingProvider with Toaster for notifications.",
  "frontend/src/components/admin/BrandingControls.tsx": "Admin form component for updating branding settings including logo URL and three color pickers (primary, secondary, accent) with live preview and backend mutation integration.",
  "frontend/src/components/admin/ClientAssignment.tsx": "Admin component for assigning clients to trainers using dropdown selects, filtering users by role and calling the assignClientToTrainer mutation.",
  "frontend/src/components/admin/ExerciseFormModal.tsx": "Modal dialog form for adding or editing exercises with fields for name, muscle groups, difficulty, equipment, video URL, description, and rep/set ranges.",
  "frontend/src/components/admin/ExerciseLibraryManagement.tsx": "Admin interface for managing the exercise library with search, add, edit, and delete functionality displayed in a card list layout.",
  "frontend/src/components/admin/UserFormModal.tsx": "Form component for adding new users (with Principal ID input) or editing existing users with fields for name, email, and role selection.",
  "frontend/src/components/admin/UserManagement.tsx": "Admin table view for managing users with add, edit, and delete actions, displaying user name, email, role badge, and action buttons.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Error screen component displaying a shield alert icon and message when users lack required role permissions, with a button to return home.",
  "frontend/src/components/auth/RoleGuard.tsx": "Authorization wrapper component that checks user role against required role and renders children or AccessDeniedScreen accordingly.",
  "frontend/src/components/client/DietPlanView.tsx": "Displays a client's diet plan with meals, food items, calories, and macros; falls back to a template diet plan if no custom plan exists.",
  "frontend/src/components/client/ProgressCharts.tsx": "Renders a line chart showing workout completion trends over time and lists the five most recent workout records.",
  "frontend/src/components/client/TimetableView.tsx": "Shows a weekly workout schedule template with muscle groups per day, plus upcoming and past scheduled training sessions.",
  "frontend/src/components/client/WorkoutLogForm.tsx": "Form component for logging completed workout sets and personal notes, submitting the data via a mutation hook.",
  "frontend/src/components/client/WorkoutPlanView.tsx": "Displays a workout plan's sets, reps, weights, and trainer notes with a button to open the workout log form dialog.",
  "frontend/src/components/exercise/ExerciseDetailModal.tsx": "Modal dialog showing detailed exercise information including video, target muscles, equipment, difficulty, and recommended volume.",
  "frontend/src/components/exercise/ExerciseLibraryBrowser.tsx": "Browsable exercise library with search and muscle group filters, displaying exercise cards that open detail modals on click.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout component that wraps pages with a Header, main content area, and Footer in a flex column structure.",
  "frontend/src/components/layout/Footer.tsx": "Footer component displaying copyright information and a branded link to caffeine.ai with a heart icon.",
  "frontend/src/components/layout/Header.tsx": "Sticky header with logo, role-based navigation (admin/trainer/client dashboards, exercises), VORTEX AI chat button, and Internet Identity login/logout functionality with mobile menu support.",
  "frontend/src/components/trainer/ClientList.tsx": "Displays a list of trainer's clients as cards showing name and email, with a button to create workout plans for each client.",
  "frontend/src/components/trainer/DietPlanForm.tsx": "Form for trainers to create diet plans with multiple meals, each containing food items with nutritional information (calories, protein, carbs, fats), and dietary notes.",
  "frontend/src/components/trainer/TimetableScheduler.tsx": "Form for trainers to schedule workout sessions by selecting a client, workout plan, date, time, and optional notes.",
  "frontend/src/components/trainer/WorkoutPlanForm.tsx": "Form for trainers to create workout plans with a name, rest time, notes, and multiple sets specifying exercise ID, reps, and weight.",
  "frontend/src/components/vortex/VortexChat.tsx": "Chat interface component for VORTEX AI assistant displayed in a side sheet, handling message sending, typing indicators, and auto-scrolling conversation history.",
  "frontend/src/components/vortex/VortexMessage.tsx": "React component that renders chat messages with formatting support for paragraphs, numbered lists, bullet lists, and inline list items. Displays messages with appropriate icons (Sparkles for Vortex, User for human) and handles typing indicators.",
  "frontend/src/contexts/BrandingContext.tsx": "React context provider that fetches branding settings and applies custom colors (primary, secondary, accent) as CSS variables to the document root. Exports useBranding hook for consuming branding data throughout the app.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates and refetches dependent queries when the actor changes, and initializes access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality. Manages authentication state, identity persistence, and AuthClient lifecycle with configurable options for idle handling and identity provider.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for data fetching and mutations including user profiles, branding settings, user management, client assignments, workout plans, diet plans, exercises, meals, and scheduled sessions. Each mutation automatically invalidates relevant query caches on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom fitness-themed color palette using OKLCH color space, featuring energetic oranges and reds for primary/accent colors. Defines CSS variables for light/dark modes and brand colors that can be dynamically overridden.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component into the DOM.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with tabbed interface for managing branding settings, users, client-trainer assignments, and exercise library. Uses shadcn/ui components for layout and navigation.",
  "frontend/src/pages/ClientDashboard.tsx": "Client dashboard page displaying workout statistics, active plans, and logged workouts with tabs for workout plans, timetable, diet plan, and progress tracking. Uses React Query hooks to fetch workout plans and records for the authenticated user.",
  "frontend/src/pages/ExerciseLibraryPage.tsx": "Simple page component that renders the ExerciseLibraryBrowser component with a header describing the comprehensive exercise library with video demonstrations.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section and feature cards highlighting expert trainers, progress tracking, custom workouts, and VORTEX AI assistant. Includes a call-to-action button that navigates to the client dashboard.",
  "frontend/src/pages/ProfileSetup.tsx": "Profile creation form for new users to enter name, email, and role (client/trainer/admin), then navigates to the appropriate dashboard after saving. Uses mutation hook to save profile data to backend.",
  "frontend/src/pages/TrainerDashboard.tsx": "Trainer dashboard displaying client statistics and tabs for managing clients, timetables, and diet plans. Includes dialogs for creating workout and diet plans for selected clients.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extending colors (using OKLCH color space), container settings, border radius variables, custom shadows, font families, and animation keyframes for accordion components.",
  "project_state.json": "Project state file for a Gym Member Portal web app with trainer/client workout tracking, admin branding controls, AI assistant (VORTEX), and exercise/diet plan features. Currently has issues with the 'Get Started' button and VORTEX AI assistant not responding conversationally or correctly to user queries."
}