{
  "backend/main.mo": "Main Motoko actor defining the workout app backend with user management (admin/trainer/client roles), workout plans, workout records, trainer-client assignments, branding settings, VORTEX AI chat, and authorization/storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting implementation of trainer dashboard, client dashboard, admin control panel, VORTEX AI chat interface, and branding customization with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components including dashboards, authentication, workout management, progress tracking, admin controls, and VORTEX AI chat interface.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements (background, foreground, primary, secondary, accent, borders, charts, sidebar).",
  "frontend/index.html": "HTML entry point for the Gym Member Portal application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React app component with TanStack Router setup, role-based routing (admin/trainer/client dashboards), authentication flow with Internet Identity, automatic dashboard redirection, and theme/branding providers.",
  "frontend/src/components/admin/BrandingControls.tsx": "Admin branding customization form with logo URL input, color pickers for primary/secondary/accent colors, live logo preview, and mutation hook to update branding settings.",
  "frontend/src/components/admin/ClientAssignment.tsx": "Admin component for assigning clients to trainers using dropdown selects to choose from filtered user lists by role, with mutation handling and toast notifications.",
  "frontend/src/components/admin/UserFormModal.tsx": "Modal form component for adding new users (with Principal ID input) or editing existing users, handling name, email, and role fields with validation and mutation hooks.",
  "frontend/src/components/admin/UserManagement.tsx": "Admin user management table displaying all users with add, edit, and delete actions, using a dialog modal for the user form.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Error screen component displayed when a user lacks the required role to access a page, with a button to navigate back home.",
  "frontend/src/components/auth/RoleGuard.tsx": "Authorization wrapper component that checks if the current user has the required role, showing AccessDeniedScreen if unauthorized or a loading state while fetching.",
  "frontend/src/components/client/ProgressCharts.tsx": "Client progress visualization component displaying a line chart of completed sets over time and a list of the five most recent workout records.",
  "frontend/src/components/client/WorkoutLogForm.tsx": "Form component for clients to log workout completion with completed sets count and optional personal notes, generating a unique record ID on submission.",
  "frontend/src/components/client/WorkoutPlanView.tsx": "Displays a workout plan card with sets, reps, weights, rest time, and trainer notes, including a button to open the workout logging dialog.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper component that structures the app with a header, main content area, and footer in a flex column layout.",
  "frontend/src/components/layout/Footer.tsx": "Footer component displaying copyright information and a 'Built with caffeine.ai' attribution link with UTM tracking parameters.",
  "frontend/src/components/layout/Header.tsx": "Main application header component with navigation, authentication controls, logo display, role-based menu items (admin/trainer/client), and VORTEX AI chat button integration.",
  "frontend/src/components/trainer/ClientList.tsx": "Displays a list of trainer's clients as cards with user info and a button to create workout plans for each client.",
  "frontend/src/components/trainer/WorkoutPlanForm.tsx": "Form component for trainers to create workout plans with plan name, rest time, notes, and dynamic sets (reps/weight) for clients.",
  "frontend/src/components/vortex/VortexChat.tsx": "Chat interface component for VORTEX AI assistant displayed in a sheet/drawer with message history, input field, and real-time AI responses.",
  "frontend/src/components/vortex/VortexMessage.tsx": "Individual message component for VORTEX chat displaying user or AI messages with icons, timestamps, and appropriate styling.",
  "frontend/src/contexts/BrandingContext.tsx": "React context provider that fetches branding settings and applies custom colors as CSS variables to enable dynamic theming.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with authentication, handling identity changes and query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom hook and provider for Internet Identity authentication, managing login state, identity storage, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend API calls including user profiles, branding settings, user management, workout plans, workout records, and client-trainer assignments. Each hook uses the actor from useActor and manages query/mutation state with cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a fitness-themed color palette (energetic oranges and reds) for both light and dark modes, including primary, secondary, accent colors and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin control panel page with tabs for branding settings, user management, and client-trainer assignments, using respective admin components within card layouts.",
  "frontend/src/pages/ClientDashboard.tsx": "Client dashboard displaying workout statistics cards, active workout plans, and progress charts in tabs, fetching data for the authenticated user's workout plans and records.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, feature cards highlighting trainers/progress/workouts/AI, and a login button using Internet Identity authentication.",
  "frontend/src/pages/ProfileSetup.tsx": "Profile creation form for new users to enter name, email, and role (client/trainer/admin), then navigates to the appropriate dashboard after successful profile save.",
  "frontend/src/pages/TrainerDashboard.tsx": "React component for the trainer dashboard displaying client statistics, tabs for managing clients and workout plans, and a dialog for creating new workout plans for selected clients.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, typography, animations, and theme extensions for the fitness application UI.",
  "project_state.json": "Project metadata defining the Gym Member Portal application with multi-role authentication (admin/trainer/client), real-time workout tracking, AI assistant VORTEX, and customizable branding features."
}