{
  "backend/main.mo": "Main Motoko actor defining all data types (User, WorkoutPlan, Exercise, DietPlan, Meal, ScheduledSession, etc.) and including authorization and blob storage mixins for the gym member portal backend.",
  "feature_evidence.json": "Feature evidence report documenting the TDEE calculator component implementation and its integration into the client dashboard with high confidence test coverage.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components including pages, hooks, contexts, and UI components with their specific functionality and data flow patterns.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors, borders, and component styling tokens.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for landing, dashboards, exercise library, flex wall, analytics, supplements, and workout logs, wrapped in theme and branding providers.",
  "frontend/src/components/admin/BrandingControls.tsx": "Admin form component for updating branding settings including logo URL and three color pickers (primary, secondary, accent) with live preview and default fallback values.",
  "frontend/src/components/admin/ClientAssignment.tsx": "Admin interface with two dropdowns to select a trainer and client from all users, then assign the client to the trainer with validation and success/error toasts.",
  "frontend/src/components/admin/ExerciseFormModal.tsx": "Modal dialog component for creating and editing exercises with form fields for name, muscle groups, difficulty, equipment, video URL, description, and rep/set ranges. Handles form submission via useAddExercise and useUpdateExercise hooks with toast notifications.",
  "frontend/src/components/admin/ExerciseLibraryManagement.tsx": "Admin interface for managing exercise library with search functionality, list view of exercises showing badges for difficulty and muscle groups, and actions to add, edit, or delete exercises. Uses ExerciseFormModal for create/update operations.",
  "frontend/src/components/admin/UserFormModal.tsx": "Form component for adding or editing users with fields for Principal ID (new users only), name, email, and role selection. Validates Principal ID format and submits via useAddUser or useEditUser hooks.",
  "frontend/src/components/admin/UserManagement.tsx": "Admin interface displaying users in a table with name, email, role badges, and action buttons for edit/delete. Opens UserFormModal dialog for user creation and editing operations.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Error screen component displaying a shield alert icon and message when users lack required role permissions, with a button to navigate back to home.",
  "frontend/src/components/auth/RoleGuard.tsx": "Authorization wrapper component that checks user profile against required role and either renders children or AccessDeniedScreen based on permission match.",
  "frontend/src/components/client/AutoRestTimer.tsx": "Countdown timer component for tracking rest periods between sets with play/pause/reset controls, progress bar, and visual/text alerts when time is running low or complete.",
  "frontend/src/components/client/CaffeinePeakTracker.tsx": "React component for logging caffeine intake and displaying optimal workout time windows based on caffeine peak calculations. Uses custom hooks for mutations and queries to interact with backend caffeine tracking functionality.",
  "frontend/src/components/client/ConnectionRequestManager.tsx": "React component with tabbed interface for managing gym buddy connections, displaying incoming/outgoing connection requests and existing connections. Provides accept/reject functionality for connection requests.",
  "frontend/src/components/client/DietPlanView.tsx": "React component that displays custom diet plans for a user, showing meals with food items, portions, calories, and macronutrient breakdowns. Falls back to template diet options if no custom plan exists.",
  "frontend/src/components/client/ExerciseScheduleSection.tsx": "Static React component displaying a grid of essential exercises with details including muscle groups, sets, reps, and descriptions. Contains hardcoded exercise data for fundamental gym movements.",
  "frontend/src/components/client/GeneralDietPlanSection.tsx": "Static React component showing a general daily meal plan with two food options for each meal period (breakfast through dinner). Contains hardcoded meal suggestions with Indian/budget-friendly options.",
  "frontend/src/components/client/GymBuddyLocator.tsx": "React component for finding and connecting with nearby gym users, displaying user cards with distance, experience level, and fitness goals. Includes dialog for sending connection requests with custom messages.",
  "frontend/src/components/client/HIITClockTimer.tsx": "A HIIT timer component with configurable work/rest durations and rounds, featuring play/pause/reset controls, progress visualization, and audio beep notifications for phase transitions.",
  "frontend/src/components/client/LocationPreferenceForm.tsx": "A form component for users to set their gym location preferences including gym name, latitude/longitude coordinates, and search radius for finding nearby training partners.",
  "frontend/src/components/client/MusicPlaylistWidget.tsx": "A workout playlist widget displaying a curated list of motivational songs with play/pause controls and scrollable interface showing song titles, artists, and durations.",
  "frontend/src/components/client/PersonalizedTracker.tsx": "A fitness calculator component that takes user metrics (weight, height, age, goal) and calculates personalized macros (calories, protein, carbs, fats) and recommends training splits based on fitness goals.",
  "frontend/src/components/client/ProgressCharts.tsx": "A progress visualization component that displays workout completion trends using line charts and lists recent workout records with sets completed and dates.",
  "frontend/src/components/client/SpotterAIInterface.tsx": "An AI-powered form analysis interface that allows users to select exercises and receive form tips, posture correction guidance, and embedded YouTube video demonstrations.",
  "frontend/src/components/client/TDEECalculator.tsx": "A React component that calculates Total Daily Energy Expenditure (TDEE) using the Mifflin-St Jeor equation and provides personalized macro targets (protein, carbs, fats) based on user inputs like weight, height, age, gender, activity level, and fitness goals.",
  "frontend/src/components/client/TimetableView.tsx": "Displays a weekly workout schedule template showing muscle groups per day, along with upcoming and past scheduled training sessions fetched from the backend, including session completion status and timing details.",
  "frontend/src/components/client/TrainingPartnerPreferenceForm.tsx": "A form component for users to set and save their training partner preferences including fitness goals, experience level, preferred workout times, and a bio description.",
  "frontend/src/components/client/WeightProgressionDisplay.tsx": "Tracks strength progression by allowing users to log weight and reps for specific exercises, displaying historical entries and progression statistics for the selected exercise.",
  "frontend/src/components/client/WorkoutLogForm.tsx": "A form component that allows users to log completed workouts by recording the number of completed sets and optional personal notes for a given workout plan.",
  "frontend/src/components/client/WorkoutPlanView.tsx": "Displays a workout plan card showing exercise sets with reps and weights, rest times, and trainer notes, with a button to open a dialog for logging workout completion.",
  "frontend/src/components/client/WorkoutSessionPanel.tsx": "React component for tracking workout sessions with rep/set counting, progress tracking, and two timer modes (standard auto-rest timer and HIIT clock). Uses useWorkoutSession hook to manage session state and displays current set details with increment/decrement controls.",
  "frontend/src/components/exercise/ExerciseDetailModal.tsx": "Modal dialog component that displays detailed exercise information including name, description, difficulty level, target muscles, equipment needed, and an embedded YouTube video demonstration. Converts various YouTube URL formats to embed URLs for video playback.",
  "frontend/src/components/exercise/ExerciseLibraryBrowser.tsx": "Browse and search component for the exercise library with filtering by muscle group and search query. Displays exercises in a card grid with difficulty badges and opens ExerciseDetailModal when clicked.",
  "frontend/src/components/exercise/QRExerciseScanner.tsx": "QR code scanner component that uses device camera to scan exercise QR codes, parses exercise IDs from various formats (plain ID, URL, JSON), and displays exercise details with video and history. Automatically stops scanning when valid exercise is detected.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper component that structures the app with Header, main content area, and Footer in a flex column layout.",
  "frontend/src/components/layout/Footer.tsx": "Footer component displaying copyright information and a 'Built with caffeine.ai' attribution link with dynamic year and app identifier.",
  "frontend/src/components/layout/Header.tsx": "Main navigation header with logo, role-based navigation menu (client/trainer/admin), authentication controls, mobile menu sheet, and VORTEX chat integration. Auto-opens VORTEX chat on mount and handles login/logout with query cache clearing.",
  "frontend/src/components/supplement/SupplementStackOptimizer.tsx": "React component that displays a supplement stack optimizer with goal selection (Muscle Gain, Fat Loss, Strength, Endurance) and tabbed views for products, dosage, timing, and benefits using custom UI components and a hook to fetch supplement stack data.",
  "frontend/src/components/trainer/ClientList.tsx": "React component that renders a list of client cards with user information and a button to create workout plans for each client.",
  "frontend/src/components/trainer/DietPlanForm.tsx": "React form component for trainers to create diet plans for clients, managing meals with food items including nutritional information (calories, protein, carbs, fats) and submitting to backend via mutation hook.",
  "frontend/src/components/trainer/TimetableScheduler.tsx": "React component that allows trainers to schedule workout sessions for clients by selecting a client, workout plan, date, time, and optional notes, then creating the session via mutation hook.",
  "frontend/src/components/trainer/WorkoutPlanForm.tsx": "React form component for creating workout plans with sets (exercise ID, reps, weight), rest time, and notes, submitting data to backend using Principal identifiers for trainer and client.",
  "frontend/src/components/vortex/VortexChat.tsx": "React chat interface component for VORTEX AI fitness assistant that manages message state, handles user input, displays typing indicators, and calls the askVortex mutation hook to get AI responses.",
  "frontend/src/components/vortex/VortexMessage.tsx": "React component that renders chat messages with formatting support for paragraphs, numbered lists, bullet lists, and mixed content. Displays messages with appropriate icons (Sparkles for Vortex, User for human) and handles typing indicators.",
  "frontend/src/contexts/BrandingContext.tsx": "React context provider that fetches branding settings and applies custom colors (primary, secondary, accent) as CSS variables to the document root. Exposes branding data and loading state via useBranding hook.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates and refetches dependent queries when the actor changes or identity updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality. Creates an AuthClient with configurable options and manages identity state, login status, and delegation validity.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including user profiles, branding, workout plans, diet plans, exercises, progress tracking, Vortex chat, and social features. Exports TypeScript interfaces for frontend data models.",
  "frontend/src/hooks/useWorkoutSession.ts": "Custom hook for managing workout session state including set progress tracking, rep counting, set completion, navigation between sets, and rest timer activation. Provides methods to increment/decrement reps and reset the session.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom dark-mode gym theme using volt green and electric blue colors in OKLCH format. Defines CSS variables for colors, neon glow effects, and applies a textured background image.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component into the DOM.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin control panel page with tabs for branding settings, user management, client-trainer assignments, and exercise library management.",
  "frontend/src/pages/AnalyticsDashboardPage.tsx": "Analytics dashboard page displaying a placeholder for upcoming progress tracking features including body weight, strength progression, and volume charts.",
  "frontend/src/pages/ClientDashboard.tsx": "Client profile dashboard with tabs for workout plans, progress tracking, timetables, diet plans, workout sessions, music playlists, caffeine tracking, personalized trackers, AI spotter, gym buddy locator, and QR scanner functionality.",
  "frontend/src/pages/ExerciseLibraryPage.tsx": "Exercise library browser page with QR code scanner functionality for viewing exercise demonstrations and form guidance.",
  "frontend/src/pages/FlexWallPage.tsx": "Placeholder page for upcoming social feed feature where users can share progress photos, PRs, and engage with the fitness community.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, feature cards highlighting personalized tracking, community features, and analytics, with call-to-action to start using the platform.",
  "frontend/src/pages/ProfileSetup.tsx": "Initial profile setup form where new users enter their name, email, and select their role (client/trainer/admin) before being redirected to the appropriate dashboard.",
  "frontend/src/pages/SupplementStackPage.tsx": "Supplement stack optimizer page that displays curated supplement recommendations based on user fitness goals.",
  "frontend/src/pages/TrainerDashboard.tsx": "Trainer dashboard page with tabs for managing clients, creating workout/diet plans, and scheduling timetables. Displays summary cards for total clients, active plans, and diet plans.",
  "frontend/src/pages/WorkoutLogsPage.tsx": "Client-facing workout logs page displaying complete training history with statistics cards for total sessions, weekly, and monthly workout counts. Shows sorted list of recent workout records.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing. Includes sessionStorage persistence and parameter cleanup functions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, neon glow effects, custom fonts (Inter, Poppins), and fitness-themed styling utilities.",
  "project_state.json": "Project state tracking document listing completed TDEE calculator features and 10 pending feature requests including exercise videos, PR leaderboard, supplement reminders, and community features."
}