{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add TDEE & Macro Calculator",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create a TDEE and macro calculator component that calculates daily calories and macronutrients based on user input",
      "acceptanceCriteria": [
        "Calculator accepts user inputs for weight (kg), height (cm), age, gender, activity level (sedentary, lightly active, moderately active, very active, extremely active), and fitness goal",
        "Displays calculated TDEE in calories per day",
        "Shows recommended daily macros breakdown: protein (grams), carbs (grams), fats (grams)",
        "Includes explanation of calculations or formula used",
        "Results are displayed in a clear, readable format with visual distinction between calorie and macro values"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/client/TDEECalculator.tsx",
          "operation": "create",
          "description": "Create a new TDEE calculator component that collects user inputs (weight, height, age, gender, activity level, fitness goal) via form fields with proper validation. Calculate TDEE using the Mifflin-St Jeor equation, then compute macro recommendations based on the selected fitness goal (weight loss: 40% protein, 30% carbs, 30% fats; maintenance: 30% protein, 40% carbs, 30% fats; muscle gain: 35% protein, 45% carbs, 20% fats). Display results in cards showing total calories and individual macro amounts in grams. Include a collapsible section explaining the calculation formulas. Use Shadcn UI components (Card, Input, Select, Button, Label) for consistent styling with the existing PersonalizedTracker component. Follow the color scheme and layout patterns from frontend/src/components/client/PersonalizedTracker.tsx."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Integrate TDEE calculator into client dashboard as a new tab alongside existing features",
      "acceptanceCriteria": [
        "TDEE calculator is accessible from the client dashboard navigation",
        "Calculator tab/section follows existing UI patterns and styling",
        "Calculator is only visible to users with client role"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ClientDashboard.tsx",
          "operation": "modify",
          "description": "Add a new tab labeled 'TDEE Calculator' to the existing Tabs component in ClientDashboard. Import the TDEECalculator component and render it within a new TabsContent section. Position the new tab after the 'Personalized Tracker' tab to group similar calculation tools together. Ensure the tab follows the existing pattern with TabsTrigger and TabsContent wrappers. The calculator will automatically be protected by the client role guard that already wraps the ClientDashboard page."
        }
      ]
    }
  ]
}