{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add detailed exercise schedule and comprehensive diet plan",
  "requirements": [
    {
      "id": "REQ-45",
      "summary": "Display seven specific exercises with sets, reps, and descriptions in exercise library browser, organized by muscle groups",
      "acceptanceCriteria": [
        "All seven exercises appear in the exercise library interface",
        "Each exercise displays its sets and reps information",
        "Exercises can be filtered by muscle group (Legs, Chest, Shoulders, Triceps, Back, Biceps, Core/Abs)",
        "Exercise descriptions are visible to users"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/exercise/ExerciseLibraryBrowser.tsx",
          "operation": "modify",
          "description": "Update the exercise card display to show sets and reps information from recommendedSetsRange and recommendedRepsRange fields. Ensure the seven specific exercises (Squats, Push-ups, Bench Press, Deadlift, Pull-ups/Lat Pulldown, Overhead Press, Plank) are rendered with their complete details when returned from the backend. Add visual indicators (badges or labels) for sets/reps alongside the existing difficulty badge. The muscle group filter should support filtering by Legs, Chest, Shoulders, Triceps, Back, Biceps, and Core/Abs based on the targetMuscleGroups field."
        },
        {
          "path": "frontend/src/components/exercise/ExerciseDetailModal.tsx",
          "operation": "modify",
          "description": "Ensure the modal displays the recommendedSetsRange and recommendedRepsRange fields prominently in the exercise details view. Format these fields to show the specific set and rep information (e.g., '3 sets x 12 reps' for Squats, '3 sets x max reps' for Push-ups, '3 sets x 1 minute' for Plank). Verify that all seven exercises display their complete descriptions and target muscle groups when opened."
        }
      ]
    },
    {
      "id": "REQ-46",
      "summary": "Display comprehensive diet plan with six meal times and two food options per meal in client dashboard",
      "acceptanceCriteria": [
        "Diet plan view shows all six meal times in chronological order",
        "Each meal displays both Option 1 and Option 2 food choices",
        "Meal options match the specified Indian food items exactly",
        "Diet plan is presented in an easy-to-read format for clients"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/client/DietPlanView.tsx",
          "operation": "modify",
          "description": "Update the component to display diet plans with a structure that supports multiple options per meal time. If the backend returns meals with the six specified meal times (Breakfast, Mid-Morning, Lunch, Pre-Workout, Post-Workout, Dinner), render them in chronological order. For each meal time, display both food options clearly labeled as 'Option 1' and 'Option 2'. Show the food items, portions, and nutritional breakdown for each option. Add visual separation between meal times using cards or sections. Ensure the layout is mobile-responsive and easy to read. If the diet plan structure includes a meals array with foodItems, render all items within each meal option."
        }
      ]
    }
  ]
}